In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame(['A','B','C'],[1,2,3])
df

   0
1  A
2  B
3  C

In [7]:
df = pd.DataFrame({"A":[1,2,3], "B":[4,5,6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [8]:
pd.DataFrame({"A":[1,2,3], "B":[4,5,6]})

   A  B
0  1  4
1  2  5
2  3  6

In [9]:
pd.DataFrame({"Apple":[30], "Banana":[42]})

   Apple  Banana
0     30      42

In [10]:
pd.DataFrame({"Apple":[30,45], "Banana":[42,56]}, index=["Sales 2017","Sales 2018"])

            Apple  Banana
Sales 2017     30      42
Sales 2018     45      56

In [12]:
pd.Series(["4 cups",'1 cup','2 large','1 can'], index=['Flour','Milk','Eggs','Spam'], name="Grocery")

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Grocery, dtype: object

In [ ]:
To read a csv file:
    pd.read_csv("path", index_col=0)    
To write a csv file:
    df.to_csv("file_name.csv")
    
To read a excell file:
    pd.read_excel("path", sheet_name="sheet name")
To write a excell file:
    df.to_excel("file_name.xlsx", sheet_name="sheet name")
    
To read a SQL file:
    import sqlite3
    connecter = sqlite3.connect("path")
    pd.read_sql_query("SELECT * FROM <table name>", connecter)
To write a SQL file:
    connecter = sqlite3.connect("table_name.sqlite")
    df.to_sql("tabel_name", connecter)

reference: kaggle.com